Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This has two benefits - One, we don't have to worry about typos or errors when writing out the array positions, and two, we have in the variable "count" the number of positions that the array contains, which can then be used elsewhere in the object.
zh_cn: 这样做有两个好处。一来可以避免打错数字，二来可以使用count这个变量计算数组包含数据的个数，这个变量可以用到物体的其它地方。

source: This help file will tell you all you need to know about GameMaker Studio 2 and how you can create your own games with it.
zh_cn: 这个帮助文件将告诉你关于 GameMaker Studio 2所有你需要知道的东西，以及你怎样在创建你的游戏时使用它们。.

source: This index of the grid to clear.
zh_cn: 待清空的栅格的索引。

source: This index of the grid to copy from.
zh_cn: 待拷贝的栅格

source: This index of the grid to copy to.
zh_cn: 待拷贝到的栅格

source: This information will also be shown in the Compiler Error Output, as shown below:
zh_cn: 这些信息也会被显示在 编译错误输出停靠栏, 如图:

source: This is a 1D (one dimensional) array which we are now going to break down the parts of to see what it means:
zh_cn: 这是一个一维数组。看起来没什么特别的吧？下面我们把它分解开来看：

source: This is a very basic functionality, and in reality all it does is move the instance back to the position it was in the moment before a collision was detected before performing any code or DnD™ that is in the event itself, and as such is of limited use.
zh_cn: 这是一个非常基本功能，实际上所有这些都是将实例移回到在执行任何代码或DnD™之前检测到冲突之前的位置本身，因此使用有限。

source: This is a curious one, but incredibly useful.
zh_cn: 异或很奇特，但非常有用。

source: This is a non-bare repository which we do not support direct cloning from.\nHowever we have found its origin so we will push to that and clone from the origin instead.
zh_cn: 这是一个非公开存储库，我们不支持从中直接克隆。\n但是，我们已经找到它的源点（origin），所以我们将推送到那并从源点克隆。

source: This is a non-bare repository which we do not support direct cloning from.\nThere is no Origin marked on this repository so we will ask you to create one so both old and new repositories will be linked via the new bare repository
zh_cn: 这不是一个公开库，不支持直接克隆。\n这个库里也没有源点(origin)标记，所以我们要求你创建一个，旧的和新的库都将链接到这个新的公开库。

source: This is a positive value from 0 - 65,535.
zh_cn: 值域为0到65535的正值。

source: This is a very important thing to remember as instances and objects are not the same thing and each have their own set of functions that can affect them.
zh_cn: 这很重要，因为这意味着物体和实例 不 同，每一个实例均有自己的一套功能。

source: This is achieved by a variety of means, with the keyboard and mouse on computers and through touch and tilting on mobile devices.
zh_cn: 有多种方法可以实现交互，比如电脑的键盘、鼠标，移动设备的触摸和倾斜。

source: This is actually pretty useful, as we can now set up CONSTANTS for bit numbers.
zh_cn: 实际上这相当有用，现在我们就可以建立比特常数（Bit Numbers）。

source: This is actually really useful, because when dividing down if we need the remainder, there's an even easier way to get it, which we'll get to in a moment.
zh_cn: 实际上，这很有用，因为当我们向下除的时候如果我们需要余数，我们就可以更容易地获取它，我们一会会去获取它。

source: This is all laid out in an intuitive fashion, with different aspects of your game "chaining" together in the IDE to give you a unique and very visual representation of the workflow.
zh_cn: 使用直观时尚的布置，在IDE中将你游戏的不同方面"链接"在一起，给你一个独特并且直观、可视化的工作流。

source: This is an event that you place in an object and then specify against which other object you should be checking for collisions.
zh_cn: 这是一个放置于一个物体，然后指定对其他物体进行碰撞检查的事件。

source: This is an invaluable tool for deciding whether to update your current version, or when you find something that may be a bug after a release.
zh_cn: 当你要更新你当前版本的时候这是个至关重要的工具，否则你可能会在下一个版本中就看到一些可能是bug的东西。

source: This is because 5 is 00000101 in binary, and following the rule above, the variable "flags" will get both these 2 bits merged with its own.
zh_cn: 因为 5 在二进制中表示为 00000101，而根据上述的规则，变量 "flags" 就会将这两个位合并进来。

source: This is because it is stored in the texture memory and may be overwritten when the target platform needs that memory for something else which means that you should always have some type of fail-safe code in place, usually with the surface_exists function.
zh_cn: 这是因为它储存在显存里，目标平台往内存里写入其它东西时就有可能会重写，所以你需要一直 在某些位置入置安全的代码，通常是 surface_exists 函数。

source: This is checked by default and represents the initial "state" of the fixture at the start of the room it has been placed in.
zh_cn: 这是默认情况下检查的，它表示在其放置的房间开始处的灯具的初始“状态”。

source: This is checked by default and un-checking it will mean that you have to manually open all newly created resources.
zh_cn: 该选项默认勾选，取消勾选意味着你必须手动打开所有新建资源。

source: This is checked by default and unchecking it will mean that you have to manually open all newly created resources.
zh_cn: 该选项默认被勾选，解除勾选该项意味着你需要手动打开所有新创建的资源。

source: This is checked by default to show the separators.
zh_cn: 默认情况下开启以显示分隔符。

source: This is checked by default to show the tree lines.
zh_cn: 默认情况下显示树状线。

source: This is checked by default.
zh_cn: 此选项默认勾选。

source: This is done by clicking the "Parent" button in the object editor and then choosing another object from the resource tree to be the "parent" of the one being edited:
zh_cn: 这可以通过单击对象编辑器中的“父”按钮，然后从资源树中选择另一个对象作为正在编辑的对象的“父”：

source: This is done by pressing + NumberKey[0 - 9], and if the bookmarked item has been closed it will be opened, otherwise the workspace will pan to the selected bookmark.
zh_cn: 做到这只需要通过按 + 小键盘[0 - 9] 即可。如果书签项目已关闭，它将被重新打开，另外工作区也将切换到所选书签（所属工作区）。

source: This is done by simply pausing the game and then clicking on any visible instance within the game window.
zh_cn: 暂停游戏，只需要点击游戏窗口中任何可见的实例，你就能实现该功能。

source: This is done in the Image Editor.
zh_cn: 绘制精灵是在 图像编辑器 中进行的。

source: This is done through the Sound Editor, which is opened whenever you create a new Sound Resource.
zh_cn: 这些操作是通过 声音编辑器 来完成的，需要你创建一个新的声音资源。

source: This is due to optimisation differences between the different target platforms, for example on the Windows target functions may be evaluated from right to left, but on the HTML5 target, they may be evaluated from left to right.
zh_cn: 这是不同目标平台之间的优化差异导致的，比如说在Windows目标平台上函数是从右到左求值的，而在HTML5平台上则是从左到右的。

source: This is enabled by default.
zh_cn: 该选项默认为启用

source: This is especially useful for those PCs that are using an on-board Intel GFX chipset or show display issues on older machines.
zh_cn: 这对于使用 Inter GFX 芯片组的电脑或在显露出显示问题的旧电脑上十分有效。

source: This is essentially a surface, just like any that you can make yourself using the surface functions, and as such can be manipulated with the surface functions, drawn to, sent to shaders and anything else that you would normally do with surface are also applicable to this.
zh_cn: 应用表面层本质上是一种表面层，可以随心所欲的使用表面层函数，并因此可以操作表面层函数，绘制、发送到着色器，通常表面可以做到的，应用表面层也可以。

source: This is extremely useful to keep your game structured and you are strongly advised to learn to use this mechanism.
zh_cn: 这对于保持游戏结构非常有用，并且强烈建议您学习使用此机制。

source: This is great news of course, since it means that you no longer have to optimise every line of code you write, but if this is the case - should you really care about binary at all?
zh_cn: 这当然是好消息，因为这意味着你不再需要优化你写的每一行代码，如果真是这样 - 你还会真正关心二进制吗？

source: This is great, but if we had to work this out every time we needed to clear flags, it would become tiresome.
zh_cn: 这是很不错的思路，但每次我们需要清除标志时，如果不得不解决这个问题，这样会变得非常烦琐。

source: This is handy for when you have, for example, a main character that moves from room to room and you want to maintain the variables within that object the same, but you should take great care to create and destroy persistent objects correctly as you can easily get errors creeping into your project by mistake.
zh_cn: 当你有一个主角从一个房间移动到另一个房间，并且你想保持该对象中的变量是一样的时候，这是方便的，但你应该非常小心地创建和销毁持久性对象正确，因为你可以轻松错误地让您的项目出现错误。

source: This is how you will reference it in code.
zh_cn: 这是您在代码中引用它的方式。

source: This is important to remember as it means that you have to do a certain amount of planning before using arrays, but it is easy enough to initialize one using a repeat loop like this...
zh_cn: 这一点很重要，因为这意味着在使用数组之前必须进行一定程度的规划，但是使用像这样的“repeat”循环来初始化它很容易......

source: This is incredibly useful; it means we can do simple multiplications by simply moving bits around.
zh_cn: 这非常有用；这意味着我们可以通过移动位来做简单的乘法。

source: This is just one of the ways that you can permit multiple configurations for movement in your games.
zh_cn: 这仅是允许多个设置处理移动的一种方法。

source: This is not a bug, but due to the startup times and the way that the game is processed when initialised).
zh_cn: 这不是一个错误，而是由于启动时间和游戏在初始化时被处理的方式所导致的）。

source: This is not strictly necessary but is the optimal way to do it as it will reserve a space in memory that is the exact size of the array, whereas if you initialize an array from 0 upwards, the memory has to be re-allocated for every additional value added.
zh_cn: 不是严格必要，但却是最好的方式，因为这样会精确地在内存中保留一个数组空间，而如果你从零向后初始化，内存将在每一次添加值时重新分配。

source: This is off by default, and enabling it will mean that every time you load and run any project the cache will need to be rebuilt (which can take time depending on the size of the game).
zh_cn: 该选项默认关闭，勾选它则意味着每次加载项目时都需要重新构建缓存（时间取决于游戏的大小）。

source: This is off by default, and enabling it will mean that every time you start GameMaker Studio 2 the cache will need to be rebuilt.
zh_cn: 该选项默认关闭，勾选它则意味着每次启动 GameMaker Studio 2 时都需要重新构建缓存。

source: This is off by default, and enabling it will mean that everytime you load and run any project the cache will need to be rebuilt (which can take time depending on the size of the game).
zh_cn: 该选项默认为关，启用此项意味着每次你载入并运行工程时需要重新创建缓存（取决于游戏的大小，这可能会花一些时间）。

source: This is off by default.
zh_cn: 该选项默认为关

source: This is on by default and is the recommended configuration since large compiler logs can slow down compile times.
zh_cn: 该选项默认为开，并且这也是推荐选项，因为过多的编译器日志会拖慢编译时间。

source: This is on by default, and switching it off will force the help file to open in workspace within the IDE.
zh_cn: 该选项默认为开，关闭该选项则会强制帮助文件在IDE的工作区内打开。

source: This is on by default.
zh_cn: 该选项默认为“开”。

source: This is primarily aimed at Education users, as - when checked - this means that whenever the program shuts down the user would be logged out and so free up the session seat for other users to use.
zh_cn: 这主要针对教育版用户，勾选该选项时，每次关闭程序用户将被注销，从而使得其他用户可以使用。

source: This is quick, very quick.
zh_cn: 这非常快，快得不得了。

source: This is really easy, knowing the rules we've used above to get the remainder, and knowing how to get the inverse of bits, we can simply do this:
zh_cn: 这很简单，使用上面我们知道的规则就可以得到余数，也知道如何得到位反数，我们可以简单地这样做：

source: This is small tools primary function is to connect to and serve files to some of the available target platforms for GameMaker Studio 2 (like the HTML5 target, for example).
zh_cn: 微型网络服务器(Micro Web Server,MWS)是一个主要用于连接GameMaker Studio 2可用的目标平台（如HTML5平台）及向目标平台添加伺服文件的小工具。

source: This is the "pure" colour tone which is part of the hue, saturation and value (luminosity) method for defining a colour.
zh_cn: 色相是一个“纯粹”的色调颜色，它是色彩的三元素（H-色调、S-饱和度、V-明度）之一。

source: This is the Project Number that is assigned when you create your Google Play API Project.
zh_cn: Project Number 在你创建安卓工程时被创建。

source: This is the amount of the "light" that is mixed into the final colour and is part of the hue, saturation and value method for defining a colour.
zh_cn: 明度指色彩的亮度，它是色彩的三元素（H-色调、S-饱和度、V-明度）之一。

source: This is the amount of the colour tone that is mixed into the final colour and is part of the hue, saturation and value (luminosity) method for defining a colour.
zh_cn: 饱和度指色彩的鲜艳（纯色）程度，它是色彩的三元素（H-色调、S-饱和度、V-明度）之一。

source: This is the array's name.
zh_cn: 这是数组名

source: This is the default method and is the one recommended by Nvidia - it should give the highest performance.
zh_cn: 这是默认的，且是Nvidia推荐的方法 - 它应该是最高的性能。

source: This is the legacy method that was used in previous versions of GameMaker - performance is poorer than the other two, but it should be compatible with almost any machine.
zh_cn: 这是 GameMaker 之前使用的一个传统方法 - 性能不如上面两个，但是应该兼容几乎任何一台机器。

source: This is the object editor window and shows the current properties, and the first thing you should do is name the object, again using a prefix like "obj_" or some other identifier.
zh_cn: 这是物体编辑器窗口，显示当前属性，你首先应该做的事情是使用 “obj_” 或其他标识符等前缀命名物体。

source: This is the position within the array that we are checking or changing.
zh_cn: 这是我们正在检查或更改的数组中的位置。

source: This is the same for all available resources, but each one has its own unique editor which will open when you do this.
zh_cn: 所有可用资源操作都是如此，但每种资源都有自己的专用的编辑器，当你完成上述操作时会打开它。

source: This is true of all binary numbers, and how the computer makes up any number internally.
zh_cn: 这适用于 所有的 二进制数，包括计算机内部构成的任何数字。

source: This is very handy as it means you can make changes to the volume using the slider at the bottom of the window and hear what the effect it will have on the sound.
zh_cn: 这使得你可以使用窗口底部的音量按钮调整音量大小。

source: This is very important to ensure the correct behaviour of your games across all the target platforms games and is essential for JavaScript platforms.
zh_cn: 这在确保各平台行为正确性特别是JavaScript平台的时候是非常重要的。

source: This is when you would use the asset layer.
zh_cn: 这时您需要使用资源层。

source: This is where the font editor is used.
zh_cn: 但是为了使字体更独特有趣，您可能希望使用其他不同的字体，这里就要用到字体编辑器了。

source: This is where we will add in the parameters to be passed to the *.exe (to create a shortcut, right click the game executable and then select Send to > Desktop (create shortcut)) .
zh_cn: 这是我们需要添加传递给 *.exe 程序的参数的地方（右键 点击游戏可执行文件选择 发送到 --> 桌面快捷方式 即可创建游戏的快捷方式）。

source: This is where you can add everything that your game requires to run, including a game room, sprites, objects, paths and a number of other things.
zh_cn: 这是所有你可以添加的游戏运行所需内容，包括房间，精灵，物体，路径和其他一些内容。

source: This layer is more of a "convenience" layer for helping you to create or edit Path resources, since it permits you to add or edit paths within the actual room space.
zh_cn: 该层更像是一个“便利”层，可以帮助您创建或编辑路径资源，因为它允许您在实际房间空间内添加或编辑路径。

source: This link cannot be opened as you are currently offline.
zh_cn: 你当前处于离线状态，因此无法打开此链接。

source: This little script rounds UP to the next boundary of the desired number.
zh_cn: 这个代码示例可以得到所需数字的下一个边界。

source: This loop will continue until the expression is found to be false.
zh_cn: 如此循环，直到表达式为假。

source: This makes life pretty simple in terms of clearing flags.
zh_cn: 就清除标志来说，这变得相当简单。

source: This marks the current runtime that has been selected for use when building your projects.
zh_cn: 这个标记当前构建项目所选中并使用的运行库。

source: This mask keeps all bits currently set, but clears the two bits we actually want cleared.
zh_cn: 这个掩码保留当前所有设置的位，但是清除我们想要清除的那两个位。

source: This may look like a lot of code, but if these numbers are constants, the compiler will pre-compile these operations into a single value so that we end up with this as actual code.
zh_cn: 这样代码可能看起来有点多，但是如果这些数是常数，那么编译器可以预编译这些指令成为单个值，使得我们最终实际代码是这样的：

source: This may require updating scripts where depth values have been used.
zh_cn: 这可能需要更新已使用深度值的脚本。

source: This means that everything that is shown in the chosen view will now be drawn to the assigned surface.
zh_cn: 这意味着所选视野内的所有显示的画面将被绘制到指定的表面。

source: This means that if the device or window loses focus or is minimised (good examples are when a screensaver comes up in Windows, or on an Android device when the app loses focus due to a call) then the surface may be destroyed.
zh_cn: 这意味着，如果设备或窗口失去焦点或最小化（很好的例子是，当Windows弹出屏幕保护程序或Android 设备来电话时应用程序失去焦点的情况），表面可能会被破坏。

source: This means that if you place a persistent object in one room, it will still be available in all subsequent rooms and will continue to perform any actions assigned to the events in its object properties, except the create event, which is only fired once when it is created initially and not when you change to a new room.
zh_cn: 这意味着如果将永久物体放在一个房间中，它仍然可以在所有后续房间中使用，并将继续执行分配给其物体属性中的事件的任何操作，创建事件，这只是在最初创建时才被触发一次，而不是当您更改为新房间时才被触发。

source: This means that there is no longer a "background" resource, and it also means that the following functions are obsolete:
zh_cn: 这也就意味着不再有“背景”资源了，并且这也意味着下述函数被弃用了：

source: This means that this event is the ideal place to initialize variables, start Timelines, set paths etc... and do anything else that generally only needs to be done once or only when an instance first appears in the room.
zh_cn: 这意味着这个事件是进行初始化变量，启动时间轴，设置路径以及只需要执行一次或者只有当一个实例第一次出现在房间里时才做的事情的最理想方式。

source: This means that you must always return the array from the script if you wish to change any array values.
zh_cn: 这也意味着，如果你想更改数组里的任何值，你 必须在脚本中返回这个数组 。

source: This means that you can create a hierarchy "switch" in which different sections of code are run depending on the input value.
zh_cn: 这意味着你可以创建一个分层的“开关”，根据输入值运行不同部分的代码。

source: This means that you can have an object with a sprite assigned, then set the draw event to draw text and the sprite will not be drawn as you have not told GameMaker Studio 2 to draw it, although the text will be.
zh_cn: 这意味着你可以有一个关联了精灵的物体，然后设置绘制事件来绘制文本，但精灵将不会被绘制，因为你还没有告诉 GameMaker Studio 2 绘制它，尽管文本（也没有告诉 GameMaker Studio 2 但却）会被绘制。

source: This means that you may need to convert absolute coordinates into local coordinates for the surface.
zh_cn: 这意味着你可能需要为表面转换坐标，从绝对坐标转换到局部坐标系。

source: This means that you only have to add one line of code into the objects to call this new scripted function, and if you wish to change something you only need to change it once in the script and all the objects will automatically run the new code, rather than have to go through every object and change the same thing in multiple places.
zh_cn: 这样的话，您只需在物体中添加一行调用代码即可调用此脚本实现预期的功能，如果您希望修改一些代码，您只需要在脚本中更改，所有调用的物体会自动运行新的代码，而不需要在所有物体中逐一修改，并且在多个地方改变修改同样的代码。

source: This means that you should have some method in place that scales the game to the required device, window or screen dimensions.
zh_cn: 这意味着，你需要额外的方法设置缩放到设备、窗口或屏幕相应的尺寸上。

source: This means the above code is incredibly useful for wrapping counters - as long as you use POW2 frame numbers.
zh_cn: 这意味着上面的代码对于包装计数器是非常有用的——只要您使用的是 2 的次方数帧。

source: This menu is for opening the general docked IDE windows.
zh_cn: 该菜单用于打开常用的 IDE 停靠窗口。

source: This menu is related to getting help when using GameMaker Studio 2.
zh_cn: 该菜单是有关在使用GameMaker Studio 2期间获得帮助的内容。

source: This menu is related to saving and loading different IDE layouts.
zh_cn: 该菜单是关于保存载入不同 IDE 布局的。

source: This menu permits you to open the various stand alone tools that are available to you within GameMaker Studio 2, with the following options:
zh_cn: 该菜单允许你在 GameMaker Studio 2 中打开各种可用的独立工具，具有如下选项：

source: This message simply means that some error has been discovered but the compiler cannot place what or where (if this happens consistently you may wish to contact YoYo Games Support and supply the details that the compiler output window shows)
zh_cn: 此信息表示编译器发现了错误，但是无法定位错误原因或位置。（如果经常发生此情况你可联系 YoYo Games Support 并提供编译器输出窗口的详细信息）

source: This method allows is to store objects, collisions, flags – all manner of things, and access them very quickly.
zh_cn: 允许使用的方法有存储物体、碰撞、标记——等各种东西，并快速地访问它们。

source: This module permits you to monitor how everything is working in your game, from the global performance, right down to the values of individual variables in individual instances.
zh_cn: 该模块允许您监视游戏中从全局性能到各个变量值的一切工作。

source: This name should never contain spaces nor unauthorized characters (only alpha-numeric characters and the underbar "_" are allowed) and should be short but memorable so that you can easily identify resources later when you may have many of them.
zh_cn: 该名称不应包含空格或未授权的字符（只允许使用字母数字字符和下划线“_”），并且应该简短但难忘，以便稍后在可能有许多文件时可以轻松识别资源。

source: This object has no source code
zh_cn: 该物体无源代码

source: This operator makes removing flags very simple, and better yet, it's usually a compile time optimisation meaning if you're using a constant number (i.e. not a variable) then the compiler will flip the bits automatically for you.
zh_cn: 这个运算符让删除标志非常简单，而且更好，这通常是一个编译时间上的优化。如果你使用一个常数值（即不是变量），然后编译器将为你自动翻转“位”。

source: This option is checked by default.
zh_cn: 选项默认勾选上。

source: This option is off by default.
zh_cn: 该选项默认为关。

source: This option is on by default.
zh_cn: 该选项默认打开。

source: This option is set to "Show Message" by default, but setting it to "OK" will suppress this warning.
zh_cn: 此选项默认为“相思消息”，选择“确定”会禁用该警告。

source: This option is set to "Show Message" by default.
zh_cn: 该选项默认为“显示消息”

source: This option is unchecked by default.
zh_cn: 默认是未勾选状态。

source: This option lets you suppress this message and always either cancel the import by selecting "No", or overwrite the current sprite by selecting "Yes".
zh_cn: 在此你可以选择“是”来忽略该提示。

source: This option lets you suppress this message by selecting "Okay".
zh_cn: 在此你可以选择“确定”来忽略该提示。

source: This option permits you to set the detection speed, with a default value of 350ms.
zh_cn: 该选项允许你设置慢双击的侦测速度，默认值为350毫秒

source: This option permits you to set the detection speed, with a default value of 500ms.
zh_cn: 此选项允许你设置响应速度，默认为 500 毫秒。

source: This option permits you to set the first of those colours to use (inlcuding alpha), and has a default value of #FFFFFD0.
zh_cn: 该选项允许你选择这两种所用颜色的第一种颜色（包括透明度），默认值为#FFFFFD0。

source: This option permits you to set the second of those colours to use (inlcuding alpha), and has a default value of #0000D0.
zh_cn: 该选项允许你选择这两种所用颜色的第二种颜色（包括透明度），默认值为#0000D0。

source: This page is going to explain a bit about what binary is as well as how it can be used when making your games.
zh_cn: 此页要解释一下，什么是二进制，以及如何在制作游戏时使用它们。

source: This permits you to set GameMaker Studio 2 to suit to your workflow and with the options in this menu you can save out the current project layouts as an *.xml file which can then be loaded into any project to set the layouts to be the same.
zh_cn: 这就允许你去设置 GameMaker Studio 2 来适应你的工作流程，而使用该菜单中的选项你可以保存当前项目的布局为一个 *.xml 文件，这个文件还可以被载入到任意一个项目当中来把IDE设置为同样的布局。

source: This project is located in an unsafe location: {0}\nPlease save it in a new location to avoid loss of work.
zh_cn: 该项目位于不安全的位置：{0}\n请将其保存到新位置，避免工作损失。

source: This project may have been moved or deleted.\nPlease verify the project location and try again.
zh_cn: 这个项目可能已被移动或删除。\n请确认项目的位置，然后再试一次。

source: This room has no creation code
zh_cn: 该房间无创建时代码

source: This runtime list details all the available runtimes, their version number, the date they were released, and, if it they are installed, the path to where they have been installed to.
zh_cn: 此运行库列表详细介绍了所有可用的运行库，及其版本号，发布日期，以及安装的运行库列表以及安装的路径。

source: This screen shot is saved to a specific directory and numbered using a variable which is then incremented.
zh_cn: 截图保存在特定的目录里，其编号使用一个变量递增后得到。

source: This script has no source code
zh_cn: 该脚本没有源代码

source: This section deals with the application surface and the functions specific to it.
zh_cn: 本节论述了应用表面层，以及它的特定函数。

source: This section deals with the dialogs that may be be shown while using the Object Editor, with the following option available:
zh_cn: 这一部分是使用物体编辑器时可能会显示的对话框，有下面可用的选项：

source: This section deals with the different scripting languages available to you for programming in GameMaker Studio 2.
zh_cn: 这一章节讨论GameMaker Studio 2向你提供的用于编程的不同的脚本语言。

source: This section deals with the preferences that you are required to set to get the Git SCM plugin to work with GameMaker Studio 2.
zh_cn: 本节讨论要求让 Git SCM在GameMaker Studio 2上能够使用的偏好设置。

source: This section details all the available runtimes, the version number, the date it was released, and, if it is installed, the path to where it has been installed to.
zh_cn: 这部分列出所有可用运行库的细节，版本号、发布的日期以及如果安装的话，它所安装的路径。

source: This section gives the few functions available for getting information about arrays:
zh_cn: 这一部分给出了一些可以用来获取关于数组（Arrays）信息的函数。

source: This section is split into the three following groups:
zh_cn: 本节分为以下三部分：

source: This section is the obligatory first stop for using GameMaker Studio 2 and getting to grips with how things work.
zh_cn: 这一章节是GameMaker Studio 2使用的必然的第一站， 需要掌握它工作的方式。

source: This section lists all the available target platforms.
zh_cn: 这部分列出了所有可用的目标平台。

source: This section lists the different menus available to you from the top bar of the GameMaker Studio 2 IDE:
zh_cn: 这一部分列出了不同的可用的菜单，它们在 GameMaker Studio 2 IDE 的顶部栏：
